Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: `--stdin` tells the command to read the content from stdin; if you don’t specify this, `hash-object` expects the path to a file.
es: La opción '--stdin' indica al comando de leer desde la entrada estandar stdin; si no lo indicas, 'hash-object' espera encontrar la ubicación de un archivo.

source: This script can’t stop the push process, but the client doesn’t disconnect until it has completed; so, be careful when you try to do anything that may take a long time.
es: Este script no puede detener el proceso de envio, pero el cliente no se desconecta hasta que no se completa su ejecución; por tanto, has de ser cuidadoso cuando intentes realizar con él tareas que puedan requerir mucho tiempo.

source: You know what the different workflows are, and you should have a pretty good grasp of fundamental Git usage.
es: En estos momentos conoces las diferentes formas de trabajar, y tienes ya un generoso conocimiento de los fundamentos de Git.

source: The first line also has the client’s capabilities.
es: La primera linea indica también las capacidades disponibles en el cliente.

source: If you press Enter after typing nothing at the `Update>>` prompt, Git takes anything selected and stages it for you:
es: Pulsando la tecla [Enter] tras el indicador 'Update>>', Git toma lo seleccionado y lo añade al área de preparación:

source: For example, if you want all but `cr-at-eol` to be set, you can do this:
es: Por ejemplo, si deseas activar todos menos 'cr-at-eol' puedes lanzar:

source: In the current project, this directory contains no files, but it does contain a simple structure:
es: En el proyecto actual, la carpeta aún no contiene archivos, pero sí contiene una estructura simple:

source: #### Identifying Binary Files ####
es: #### Identificando archivos binarios ####

source: This first example describes contributing via forking on Git hosts that support easy forking.
es: En este primer ejemplo, veremos cómo contribuir a través de bifurcaciones (forks) en servidores Git que soporten dichas bifurcaciones.

source: Are you involved in that process?
es: ¿Participas en ese proceso de aprobación?.

source: The simple case is the example you just saw, running `git checkout -b [branch] [remotename]/[branch]`.
es: El ejemplo más simple, es el que acabas de ver al lanzar el comando 'git checkout -b [rama] [nombreremoto]/[rama]'.

source: The most common range specification is the double-dot syntax.
es: La especificación de rango más común es la sintaxis doble-punto.

source: Instead, you must run `git diff-tree` with the branch you want to compare to:
es: En su lugar, se ha de emplear el comando `git diff-tree` con la rama que se desea comparar:

source: The `objects` directory stores all the content for your database, the `refs` directory stores pointers into commit objects in that data (branches), the `HEAD` file points to the branch you currently have checked out, and the `index` file is where Git stores your staging area information.
es: La carpeta 'objects' guarda el contenido de tu base de datos, la carpeta 'refs' guarda los apuntadores a las confirmaciones de cambios (commits), el archivo 'HEAD' apunta a la rama que tengas activa (checked out) en este momento, y el archivo 'index' es donde Git almacena la información sobre tu area de preparación (staging area).

source: To see the same information in a much more useful way, we can run `git log -g`, which will give you a normal log output for your reflog.
es: Para ver la misma información de manera mucho más amigable, podemos utilizar el comando `git log -g`. Este nos muestra una salida normal de registro:

source: You get a clean summary of all the commits since v1.0.1, grouped by author, that you can e-mail to your list.
es: Obtendrás un claro resumen de todas las confirmaciones de cambios (commit) desde la versión v1.0.1, agrupadas por autor, y listas para ser incorporadas en un mensaje a tu lista de correo.

source: The main problem with this in Git is that you can’t modify a file with information about the commit after you’ve committed, because Git checksums the file first.
es: El principal problema para hacerlo en Git reside en la imposibilidad de modificar los ficheros con información relativa a la confirmación de cambios (commit). Debido a que Git calcula sus sumas de comprobación antes de las confirmaciones.

source: If you’re on a Windows machine, set it to `true` — this converts LF endings into CRLF when you check out code:
es: Si estás trabajando en una máquina Windows, ajustalo a 'true', --para convertir finales LF en CRLF cuando extraigas código (checkout)--.

source: The next place Git looks is the `~/.gitconfig` file, which is specific to each user.
es: El segundo es el archivo '~/.gitconfig', específico para cada usuario.

source: Technically, `git am` is built to read an mbox file, which is a simple, plain-text format for storing one or more e-mail messages in one text file.
es: Técnicamente, 'git am' se construyó para leer un archivo de buzón de correo (mbox file), que no es más que un simple formato de texto plano para almacenar uno o varios mensajes de correo electrónico en un solo archivo de texto.

source: You can see where you’ve been at any time by running `git reflog`:
es: Con el comando `git reflog` puedes revisar donde has estado en cualquier momento pasado:

source: It adds a section to your `.git/config` file, specifying the name of the remote (`origin`), the URL of the remote repository, and the refspec for fetching:
es: Esto añade una nueva sección a tu archivo `.git/config`, indicando el nombre del remoto (`origin`), la ubicación (URL) del repositorio remoto y la referencia para recuperar (fench) desde él:

source: Now that you have the packfile index, you can see if your object is in it — because the index lists the SHAs of the objects contained in the packfile and the offsets to those objects.
es: Una vez tengas el índice del empaquetado, puedes mirar si el objeto buscado está en él, (Dicho índice contiene la lista de SHAs de los objetos dentro del empaquetado y las ubicaciones -offsets- de cada uno de llos dentro de él.)

source: So, you can either run four config commands
es: Es decir, has de ejecutar cuatro comandos de configuración:

source: Let’s say you just pushed out a release of your code to a production environment, you’re getting bug reports about something that wasn’t happening in your development environment, and you can’t imagine why the code is doing that.
es: Por ejemplo, en caso de aparecer problemas justo tras enviar a producción un cierto código que parecia funcionar bien en el entorno de desarrollo.

source: This is also useful if you have multiple packfiles on the server, so you can see which packfile contains the object you need:
es: Hacer la comprobacion es sobre todo util en aquellos casos donde existan multiples archivos empaquetados en el servidor, para determinar así en cual de ellos se encuentra el objeto que necesitas:

source: Just to have a target, assume that each message has to include a string that looks like "ref: 1234" because you want each commit to link to a work item in your ticketing system.
es: Simplemente por fijar algo concreto, supongamos que cada mensaje ha de incluir un texto tal como "ref: 1234", porque quieres enlazar cada confirmación de cambios con una determinada entrada de trabajo en un sistema de control.

source: When all the patches for your topic are applied and committed into your branch, you can choose whether and how to integrate them into a longer-running branch.
es: Cuando tengas integrados y confirmados todos los parches relativos al tema puntual en que estas trabajando, puedes plantearte cómo y cuándo lo vas a integar en alguna otra rama de más largo recorrido.

source: The `git verify-pack` plumbing command allows you to see what was packed up:
es: Y, para eso, has de utilizar el comando "de fontaneria" `git verify-pack`:

source: For example, to set the meta information in your diff output to blue foreground, black background, and bold text, you can run
es: Por ejemplo, para mostrar la meta-información del comando 'diff' con letra azul sobre fondo negro y con caracteres en negrita, puedes indicar:

source: The `fetch-pack` process sends data that looks like this to the daemon after connecting:
es: Tras la conexión, el proceso `fetch-pack` envia datos de una forma parecida a esta:

source: hotfix branch based back at your master branch point.
es: rama 'hotfix' basada en la rama 'master' original.

source: ### Removing Objects ###
es: ### Borrando objetos ###

source: You have a number of choices, so I’ll cover a few of them.
es: Tienes bastantes opciones, y vamos a ver algunas de ellas.

source: However, many larger public projects accept patches via a developer mailing list, so I’ll go over an example of that now.
es: De todas formas, muchos de los proyectos públicos más grandes aceptar parches a través de una lista de correo electrónico, por lo que veremos un ejemplo de dicho procedimiento.

source: To contribute to that project, you create your own public clone of the project and push your changes to it.
es: Para contribuir en este tipo de proyecto, crearás tu propio clón público del mismo y enviarás (push) tus cambios a este.

source: If something is missing or the tests don’t pass, exiting non-zero also aborts the `git am` script without committing the patch.
es: Si falta algo o si alguna de las pruebas falla, saliendo con un código de salida distinto de cero abortará el comando 'git am' sin confirmar el parche.

source: These path-specific settings are called Git attributes and are set either in a `.gitattribute` file in one of your directories (normally the root of your project) or in the `.git/info/attributes` file if you don’t want the attributes file committed with your project.
es: Estos ajustes específicos relacionados con un camino, se denominan atributos en Git. Y se pueden fijar, bien mediante un archivo '.gitattribute' en una de las carpetas de tu proyecto (normalmente en la raiz del proyecto), o bien mediante el archivo 'git/info/attributes en el caso de no querer guardar el archivo de atributos dentro de tu proyecto.

source: Here is a small Ruby script that does that:
es: Este podria ser un pequeño script Ruby para hacerlo:

source: When you receive such a project, you get the directories that contain submodules, but none of the files yet:
es: Cuando se recibe, se reciben también las carpetas que contienen los submódulos; pero no se reciben ninguno de los archivos de dichos submódulos:

source: Also notice that it doesn’t need to point to a commit; you can tag any Git object.
es: Y también el que no ha sido necesario apuntar directamente a una confirmación de cambios. Realmente puedes etiquetar cualquier tipo de objeto Git.

source: In order to resolve the conflict, you have to either choose one side or the other or merge the contents yourself.
es: Para resolver el conflicto, has de elegir manualmente contenido de uno o de otro lado.

source: ### Merge Strategies ###
es: ### Estrategias de fusión ###

source: You can keep the changes there for minutes, days, or months, and merge them in when they’re ready, regardless of the order in which they were created or worked on.
es: Puedes mantener los cambios ahí durante minutos, dias o meses; y fusionarlos cuando realmente estén listos. En lugar de verte obligado a fusionarlos en el orden en que fueron creados y comenzaste a trabajar en ellos.

source: The last major range-selection syntax is the triple-dot syntax, which specifies all the commits that are reachable by either of two references but not by both of them.
es: La última de las opciones principales para seleccionar rangos es la sintaxis triple-punto. Utilizada para especificar todas las confirmaciones de cambio alcanzables separadamente desde cualquiera de dos referencias, pero no desde ambas a la vez.

source: Git constructs a header that starts with the type of the object, in this case a blob.
es: Git construye la cabecera comenzando por el tipo de objeto, en este caso un objeto binario grande (blob).

source: It takes a single argument: the name of the temporary file that contains the proposed commit message.
es: Recibe un solo argumento: el nombre del archivo temporal que contiene el mensaje de confirmación propuesto.

source: Then, tell Git what the "indent"" filter does on smudge and clean:
es: E indicando después que el filtro "indent" actuará al manchar (smudge) y al limpiar (clean):

source: Like many other Version Control Systems, Git has a way to fire off custom scripts when certain important actions occur.
es: Al igual que en otros sistemas de control de versiones, Git también cuenta con mecanismos para lanzar scrips de usuario cuando suceden ciertas acciones importantes.

source: HEAD points to another branch when you switch branches.
es: Apuntador HEAD apuntando a otra rama cuando saltamos de rama.

source: At this point, you can run your test to see if the issue exists as of this commit.
es: En este punto, se pueden lanzar las pruebas pertinentes para ver si el problema existe en esa confirmación de cambios extraida.

source: Let’s work from the previous example.
es: Si utilizamos el mismo ejemplo usado anteriormente,

source: If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.
es: Si dispones de un sistema de archivos compartido, podrás clonar (clone), enviar (push) y recibir (pull) a/desde repositorios locales basado en archivos.

source: In this chapter, I’ll go through some operations that you can use to make Git operate in a more customized fashion by introducing several important configuration settings and the hooks system.
es: En este capítulo, avanzaremos sobre ciertas operaciones que puedes utilizar para personalizar el funcionamiento de Git ; presentando algunos de sus principales ajustes y el sistema de anclajes (hooks).

source: First, you need to add something like the following to the `/etc/gitweb.conf` file:
es: Previamente, has de añadir algo como esto al archivo '/etc/gitweb.conf':

source: Simple version of the Git data model.
es: Versión simplificada del modelo de datos de Git.

source: You can also see from the header on each of your project’s pages that you have two Git URLs (see Figure 4-8).
es: En la página de cabecera de cada uno de tus proyectos, podrás ver dos URLs (ver Figura 4-8).

source: The `git describe` command favors annotated tags (tags created with the `-a` or `-s` flag), so release tags should be created this way if you’re using `git describe`, to ensure the commit is named properly when described.
es: El comando 'git describe' da preferencia a las etiquetas anotativas (etiquetas creadas con las opciones '-a' o '-s'). De esta forma las etiquetas para las versiones pueden ser creadas usando 'git describe', asegurandose el que las confirmaciones de cambios (commit) son adecuadamente nombradas cuando se describen.

source: You can zlib-uncompress it, strip off the header, and look at the commit content:
es: Puedes descomprimirlo, quitarle la cabecera y mirar el contenido:

source: Another nice thing is that HTTP is such a commonly used protocol that corporate firewalls are often set up to allow traffic through this port.
es: Otro detalle muy util de emplear HTTP, es que, al ser un protocolo de uso común, la mayoría de los cortafuegos corporativos suelen tener habilitado el tráfico a traves de este puerto.

source: Now that you have basic read/write and read-only access to your project, you may want to set up a simple web-based visualizer.
es: Ahora que ya tienes acceso básico de lectura/escritura y de solo-lectura a tu proyecto, puedes querer instalar un visualizador web.

source: It’s generally undesirable for the Git protocol to be the only access to your project.
es: No es recomendable tenerlo como único protocolo de acceso a tus proyectos.

source: Here’s the object SHA-1 value it created:
es: Este es el objeto SHA-1 creado:

source: Jessica can now merge this into the work she did with `git merge`:
es: Y los fusiona con su propio trabajo:

source: If you want some repositories to be read-only to certain users and read/write to others, access and permissions can be a bit difficult to arrange.
es: En caso de requerir varios repositorios de solo lectura para ciertos usuarios y de lectura/escritura para otros, preparar el acceso y los permisos puede dar bastante trabajo.

source: Insert 18333fig0513.png Figure 5-13.
es: Insert 18333fig0513.png Figura 5-13.

source: When you have hundreds of users, it’s much more of a pain to manage that process.
es: Pero, cuanto tengas cientos de usuarios, se hace bastante pesado gestionar así ese proceso.

source: After you commit and push that change, all four users will be able to read from and write to that project.
es: Tras confirmar (commit) y enviar (push) estos cambios, los cuatro usuarios podrán acceder a leer y escribir sobre el proyecto.

source: A way to remember this command is by recalling the `git push [remotename] [localbranch]:[remotebranch]` syntax that we went over a bit earlier.
es: Una manera de recordar este comando es dándonos cuenta de que proviene de la sintaxis 'git push [nombreremoto] [ramalocal]:[ramaremota]'.

source: In centralized systems, there is generally a single collaboration model—the centralized workflow.
es: En los sistemas centralizados, tenemos una única forma de trabajar.

source: If your project is open source, you also get a huge community of developers who now have visibility into your project and may well fork it and help contribute to it.
es: Si tu proyecto es de código abierto, puedes tener también una amplia comunidad de desarrolladores que podrán ver tu proyecto, bifurcarlo (fork) y ayudar contribuyendo a él.

source: For example, say you run `git push origin master` in your project, and `origin` is defined as a URL that uses the SSH protocol.
es: Por ejemplo, si lanzas el comando `git push origin master` en tu proyecto y `origin` está definida como una ubicación que utiliza el protocolo SSH.

source: ## Revision Selection ##
es: ## Selección de confirmaciones de cambios concretas ##

source: Git can figure out a short, unique abbreviation for your SHA-1 values.
es: En todos estos casos, Git puede deducir el resto del valor SHA-1.

source: Now, no matter what is set as your default shell editor variable, Git will fire up Emacs to edit messages.
es: A partir de ese comando, por ejemplo, git lanzará Emacs cada vez que vaya a editar mensajes; indistintamente del editor configurado en la línea de comandos (shell) del sistema.

source: Insert 18333fig0520.png Figure 5-20.
es: Insert 18333fig0520.png Figura 5-20.

source: It’s important to notice that it isn’t the SHA of the commit, but of the blob itself:
es: Es importante destacar que no se trata de la suma SHA de la confirmación de cambios (commit), sino del propio objeto binario (blob):

source: Let’s assume you’ve received a few keys by e-mail and saved them to temporary files.
es: Suponiendo que hayas recibido las claves por correo electrónico y que las has guardado en archivos temporales.

source: The default branch name in Git is master.
es: La rama por defecto de Git es la rama 'master'.

source: This is an important point with submodules: you record them as the exact commit they’re at.
es: Esto es importante al trabajar con submódulos: siempre son almacenados como la confirmación de cambios concreta en la que están.

source: The SHA-1 digest is 20 bytes or 160 bits.
es: Los códigos SHA-1 son de 20 bytes, (160 bits).

source: It means that at the core of Git is a simple key-value data store.
es: Pues significa que el núcleo Git es un simple almacén de claves y valores.

source: Now you can send the maintainer a message that you’ve made the requested changes and they can find those changes in your `featureBv2` branch (see Figure 5-18).
es: En estos momentos, puedes notificar al gestor del proyecto que has realizado todos los cambios solicitados y que los puede encontrar en tu rama 'featureBv2' (ver Figura 5-18).

source: ### Dictator and Lieutenants Workflow ###
es: ### Flujo de trabajo con Dictador y Tenientes ###

source: For example, say you have a commit history that looks like Figure 6-1.
es: Por ejemplo, teniendo un historial de confirmaciones de cambio tal como el de la figura 6-1.

source: It works by going to the common ancestor of the two branches (the one you’re on and the one you’re rebasing onto), getting the diff introduced by each commit of the branch you’re on, saving those diffs to temporary files, resetting the current branch to the same commit as the branch you are rebasing onto, and finally applying each change in turn.
es: Haciendo que Git: vaya al ancestro común de ambas ramas (donde estás actualmente y de donde quieres reorganizar), saque las diferencias introducidas por cada confirmación en la rama donde estás, guarde esas diferencias en archivos temporales, reinicie (reset) la rama actual hasta llevarla a la misma confirmación en la rama de donde quieres reorganizar, y, finalmente, vuelva a aplicar ordenadamente los cambios.

source: Rather than remove a specific file with something like `rm file`, you have to remove it with `git rm --cached` — you must remove it from the index, not from disk.
es: En lugar de borrar un archivo concreto con una orden tal como `rm archivo`, has de borrarlo con `git rm --cached` (es decir, tienes que borrarlo del índice, en lugar de del disco).

source: If you’re running this on a server outside your firewall, it should only be used for projects that are publicly visible to the world.
es: Si lo estás utilizando en un servidor fuera del perímetro de tu cortafuegos, se debe utilizar exclusivamente para proyectos que han de ser públicos, visibles para todo el mundo.

source: Contributing to public projects is a bit different.
es: Contribuir a proyectos públicos es ligeramente diferente.

source: Now you’re on another commit, halfway between the one you just tested and your bad commit.
es: Git extraeria otra confirmación de cambios, aquella a medio camino entre la que se acaba de chequear y la que se habia indicado como erronea al principio.

source: The other way to move introduced work from one branch to another is to cherry-pick it.
es: El otro camino para introducir trabajo de una rama en otra, es entresacarlo.

source: The second developer must merge in the first one’s work before pushing changes up, so as not to overwrite the first developer’s changes.
es: El segundo desarrollador deberá fusionar previamente su trabajo con el del primero, antes de enviarlo, para evitar el sobreescribir los cambios del primero.

source: Here you’ll use a format very much like the CVS ACL mechanism: it uses a series of lines, where the first field is `avail` or `unavail`, the next field is a comma-delimited list of the users to which the rule applies, and the last field is the path to which the rule applies (blank meaning open access).
es: Su formato es muy parecido al del mecanismo CVS ACL: utiliza una serie de líneas donde el primer campo es 'avail' o 'unavail' (permitido o no permitido), el segundo campo es una lista de usuarios separados por comas, y el último campo es la ubicación (path) sobre el que aplicar la regla (dejarlo en blanco equivale a un acceso abierto).

source: After this comes a Commands section.
es: Tras esa lista, viene la sección de comandos.

source: Here you’ll clone a project with a submodule in it.
es: Si se tiene un proyecto con submódulos dentro de él.

source: Now that you have the basics of branching and merging down, what can or should you do with them?
es: Ahora que ya has visto los procedimientos básicos de ramificación y fusión, ¿qué puedes o qué debes hacer con ellos?
